; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared5 - mode
	image2 - mode
	image4 - mode
	infrared1 - mode
	image3 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation7 - direction
	Star5 - direction
	Star3 - direction
	GroundStation6 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 image4)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
)
(:goal (and
	(have_image Star14 spectrograph0)
	(have_image Star14 image3)
	(have_image Planet15 infrared5)
	(have_image Star16 spectrograph0)
	(have_image Phenomenon17 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (turn_to satellite1 groundstation6 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 5
4. (calibrate satellite1 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 5
5. (turn_to satellite1 phenomenon17 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon17)
   goals met: 0 of 5
6. (take_image satellite1 phenomenon17 instrument1 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 1 of 5
7. (turn_to satellite1 planet15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet15)
   goals met: 1 of 5
8. (take_image satellite1 planet15 instrument1 infrared5)
   added: (have_image planet15 infrared5)
   goals met: 2 of 5
9. (turn_to satellite1 star14 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star14)
   goals met: 2 of 5
10. (take_image satellite1 star14 instrument1 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 3 of 5
11. (turn_to satellite1 star16 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star16)
   goals met: 3 of 5
12. (take_image satellite1 star16 instrument1 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 4 of 5
13. (turn_to satellite0 star14 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star14)
   goals met: 4 of 5
14. (turn_to satellite0 star5 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star5)
   goals met: 4 of 5
15. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 4 of 5
16. (turn_to satellite0 star14 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star14)
   goals met: 4 of 5
17. (take_image satellite0 star14 instrument0 image3)
   added: (have_image star14 image3)
   goals met: 5 of 5
